------------------------------------------------------------------------------------
--Name：            170922[英文征服][活动脚本]德州广告NPC制作（长期）
--Creator:      杨艳
--Created:     2017/09/22
------------------------------------------------------------------------------------
-- #任务需求:
-- 【英文征服】德州广告NPC制作（长期）
-- 需求：
-- 制作德州广告NPC，长期使用。点击跳出850*480内嵌弹窗，介绍最新德州赛事。
-- NPC详细需求见附件。
-- 如有问题，及时沟通。
-- ===npc弹是内嵌网页功能链接
-- 杨艳制作


-- ******************************************************************
-- *徐帆(设计中心任务部任务设计处)在2017-09-22 14:10修改任务(任务号：7759522)时补充了如下需求：
-- ******************************************************************
-- 提供内嵌弹窗网址为：
-- http://co.99.com/guide/event/2017/pokerevent/client/
------------------------------------------------------------------------------------
--命名前缀
--TexasAdNpc_
------------------------------------------------------------------------------------

--网页
local tTexasAdNpc_Web = {}
	tTexasAdNpc_Web["The_web"]="https://co.99.com/guide/event/2020/COSilverClub/"
	


---------------------------------逻辑部分---------------------------------------------------
--点击NPC弹出内嵌网页
function TexasAdNpc_Web_OpenWeb()
	local nUserId = Get_UserId()
	User_SendWebDialog(tTexasAdNpc_Web["The_web"],nUserId)
end
















